# Практикум по Pandas

In [4]:
import pandas as pd
import numpy as np

In [ ]:
# метод aggregate появился в версии Pandas 0.20.0
# Если выдается ошибка AttributeError: 'DataFrame' object has no attribute 'aggregate', то надо обновить Pandas
# conda update pandas
# или conda update conda

In [ ]:
# если вы запускаете notebook в другом ядре (например, питон 3.6 при основной версии питона на компьютере 2.7), то
# обновляем версию Pandas для этого ядра:
# смотрим какие ядра установлены: conda info --envs
# активируем нужное ядро: source activate python3 (в Windows команда без source)
# обновляем Pandas: conda update pandas

In [ ]:
# Проверяем версию Pandas
pd.__version__

# Создание DataFrame из листов и словарей

In [ ]:
dataList = [
    {'date' : '2017-07-01', 'value' :100},
    {'date' : '2017-07-02', 'value' :200},
    {'date' : '2017-07-03', 'value' :300},
    {'date' : '2017-07-04', 'value' :400},
    {'date' : '2017-07-05', 'value' :500},
]

In [ ]:
pd.DataFrame( dataList )

In [ ]:
# Тоже самое, но в другом виде
# Задаем столбцы

dataDict = {
    'date':['2017-07-01','2017-07-02','2017-07-03','2017-07-04','2017-07-05'],
    'value':[100,200,300,400,500]
}

pd.DataFrame.from_dict( dataDict )

In [ ]:
# Для сохранения порядка следования элементов можем использовать вместо словаря
dataDicty = [
    ('date', ['2017-07-01','2017-07-02','2017-07-03','2017-07-04','2017-07-05']),
    ('value',[100,200,300,400,500])
]

pd.DataFrame.from_dict( dict(dataDicty) )

# Создание Series

In [ ]:
# Можно использовать Numpy для генерации данных
dataNP = np.random.rand(3)

In [ ]:
# numpy - array
type(dataNP)

In [ ]:
pd.Series(dataNP, index= ['first','second','third'])

# Импорт данных для DataFrame из файлов

In [ ]:
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html#pandas.read_csv
# указываем разделитель столбцов в файле
# заголовок у файла есть, но можно задать свои названия (удобно, если изначально они на русском)
# выводим первые 10 строк

data = pd.read_csv('train.csv',delimiter=',')

In [ ]:
data.tail()

In [ ]:
data.head()

In [ ]:
# основная информация о нашем DataFrame
# хорошо показывает в каких данных много пропусков
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.info.html
data.info()

Столбцы SibSp и Parch (наличие родственников среди пассажиров) распознаны как целое число. Если недо это исправить, то используем dtype:

In [ ]:
data = pd.read_csv('train.csv', delimiter=',', dtype = {'SibSp' : str, 'Parch':str} )
data.info()

In [ ]:
# статистика DataFrame
# вывод зависит от типа данных
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.describe.html
data.describe()

# Распределение стодбца

In [ ]:
type(data['Pclass'])

In [ ]:
data['Pclass'].value_counts()

# Гистограмма распределения

In [ ]:
# Рисуем в браузере
%matplotlib inline

In [ ]:
data.hist( column = ['Age'])

Можно и так

In [ ]:
data['Age'].hist( bins= 25,figsize = (10,5))

# ### Упражнение

Загрузите в датафрейм mountains содержимое файла Mountains.csv. Посчитайте следующие показатели:
1. Минимальную и максимальную высоту гор в этом наборе

2. В каком году было впервые покорено наибольшее количество вершин (столбец First ascent)?

3. Постройте распределение распределение First ascent по годам

In [ ]:
mountains = pd.read_csv('Mountains.csv', delimiter=',')

In [ ]:
mountains['First ascent'].value_counts().sort_index()

In [ ]:
mountains.describe()

In [ ]:
mountains['First ascent'].value_counts()

In [ ]:
mountains['First ascent'].hist(bins= 100,figsize = (30,5))

# Поэлементные действия с DataFrame

In [ ]:
# зададим два DataFrame
df1 = pd.DataFrame([(0,1),(2,3),(4,5)], columns = ['value1','value2'])
df1

In [ ]:
df2 = pd.DataFrame([(10,11),(12,13),(14,15),(17,18)], columns = ['value1','value3'])
df2

In [ ]:
# Функция сложения
df1.add(df2)

In [ ]:
# для несовпадающих строк используем значение из fill_value
df1.add(df2,fill_value = 100).fillna(0)

# mul - перемножение

In [ ]:
df1.mul(df2,fill_value=0)

# div - поэлементное деление

In [ ]:
df1.div(df2,fill_value=17)

# Разность DataFrame

In [ ]:
df1.sub(df2)

# Корректное копирование DataFrame

In [ ]:
# Зададим DataFrame
df1 = pd.DataFrame( [ (0, 1) ],columns = ['value1','value2'] )
df1

In [ ]:
# делаем его копию
df2 = df1

In [ ]:
# Изменяем значение ячейки в копии
df2['value1'][0] = 555

In [ ]:
df2

Смотрим что произошло с исходником

In [ ]:
df1

Сделаем настоящую копию

In [ ]:
df1 = pd.DataFrame( [ (0, 1) ],columns = ['value1','value2'] )
df1

In [ ]:
df2 = df1.copy()

In [ ]:
df2['value1'][0] = 555

In [ ]:
df2

In [ ]:
df1

# Сводные таблицы

In [ ]:
data = pd.read_csv( 'train.csv', delimiter = ',' )
data.head()

In [ ]:
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.pivot.html
# index - значения столбца, которые будут в строках
# columns - значения столбца, которые образуют столбцы
# values - значения в ячейках таблицы
# aggfunc - функция, которая будет применена к значениям

# среднее значение столбца 'Age' в разбивке по Sex и Embarked
pd.pivot_table( data, index = ['Sex', 'Pclass'], columns = ['Embarked'], values = 'Age', aggfunc = np.mean )

# Apply - применить функциу или строке

In [ ]:
data = pd.read_csv('train.csv', delimiter=',')
data.head(20)

In [ ]:
def ageGroup(row):
    """
    Простая функция отнесения возраста к группе
    """
    
    passenger_type = 'Undef'
    # Проверяем, что значение возраста не равно NaN
    if not pd.isnull(row['Age']):
        if row['Age'] <= 18:
            passenger_type = 'Child'
        elif row['Age'] >=65:
            passenger_type = 'Retiree'
        else:
            passenger_type = 'Young'
    
    # Если значение возраста NaN, то возвращает Undef
    return passenger_type

In [ ]:
def ageGroup2( row ):
    """
    Простая функция отнесения возраста к группе
    """
    
    # проверяем, что значение возраста не равно NaN
    if not pd.isnull( row['Age'] ):
        if row['Age'] <= 18:
            return 'Child'

        if row['Age'] >= 65:
            return 'Retiree'

        return 'Young'
    
    # если значение возраста NaN, то возвращаем Undef
    return 'Undef'

In [ ]:
# Примениим функцию ageGroup к DataFrame и выведем результат в отдельный столбец ageGriup

data['ageGroup'] = data.apply(ageGroup, axis = 1)
data.head(10)

In [ ]:
# Выводит только указанные значения. Грубо говоря филтрация

data[data['ageGroup'].isin(['Young','Undef']) ]

# Applymap - применяем функцию к каждой ячейке отдельно

In [ ]:
# Например устанавливаем формат отображения

df = pd.DataFrame ( np.random.randn(10,3), columns = ['first','second','third'])
df

In [ ]:
df.apply( lambda x : x**2)

# Упражнение

Классифицируйте высоту гор и посчитайте распределение количества вершин по этой классификации:
* высота до 7500 метров - High
* до 8000 метров - Very high
* более 8000 метров - Extremely high

# Сохранение DataFrame

In [ ]:
mns = pd.read_csv('Mountains.csv', delimiter=',')
mns.head(20)

In [ ]:
def mountHigh(row):
    if not pd.isnull(row['Height (m)']):
        if row['Height (m)'] <= 7500:
            return 'High'
        elif row['Height (m)'] <= 8000:
            return 'Very High'
        else:
            return 'Extremely High'
        
    return 'Undef'

In [ ]:
mns['mountHighest'] = mns.apply(mountHigh, axis = 1)

mns.head(20)

In [ ]:
mns['mountHighest'].value_counts()

# Сохранение DataFrame

In [ ]:
data.head()

In [ ]:
# СОхранаяем датафрейм куда либо выбираем формат файла в котором сохраняем
data.to_

In [ ]:
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.to_csv.html
# разделитель sep по умолчанию запятая
# na_rep - что ставим на место пустых ячеек
# columns - какие столбцы хотим записать
# index - включать ли номер строки

data.to_csv( 'train_modified.csv', sep = ';', na_rep = '0', columns = ['Survived', 'ageGroup'], index = False )

In [ ]:
# Посмотреть документацию
?pd.DataFrame.to_csv

In [ ]:
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.to_json.html
# при сохранении в JSON может быть несколько вариантов группировки данных

# orient = index - строки имеют вид
# {"0":{"PassengerId":1,"Survived":0,"Pclass":3,"Name":"Braund, Mr. Owen Harris","Sex":"male","Age":22.0,"SibSp":1,"Parch":0,"Ticket":"A\/5 21171","Fare":7.25,"Cabin":null,"Embarked":"S","ageGroup":"Young"}

data.to_json( 'train_json_index.json', orient = 'index' )

In [ ]:
# другие варианты

data.to_json( 'train_json_columns.json', orient = 'columns' )
data.to_json( 'train_json_records.json', orient = 'records' )

In [ ]:
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.to_excel.html
# сохранение в Excel

data.to_excel( 'train_modified.xlsx', sheet_name = 'data' )

# Типовые действия с DF

In [ ]:
data = pd.read_csv('train.csv', delimiter=',')
data.head(5)

In [61]:
# Выбрать все строки и подмножества столбцов
dataSelected = data.loc[:3,['Name','Age','Cabin']]
dataSelected.head()

                                                Name   Age Cabin
0                            Braund, Mr. Owen Harris  22.0   NaN
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0   C85
2                             Heikkinen, Miss. Laina  26.0   NaN
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0  C123

In [ ]:
# Добавляем к фильтру строки
# например с третьей по пятнадцатую
dataSelected = data.loc[2:15,['Name','Age','Cabin']]
dataSelected.head()

# Добавить столбцы

In [ ]:
# Посчитать количество слов в столбце Name
# сначала разбиваем на слова
data['nameLength'] = data['Name'].str.split(',')
data.head()

In [65]:
# Длбавляем подсчет количества слов 
data['nameLength'] = data['Name'].str.split(',').str.len()
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,nameLength
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,2

In [ ]:
# Удалить столбец
del data['nameLength']
data.head()

In [ ]:
# Переименование столбца
# Например Inplce указывает, что надо подставить новое значение в самом DataFrame data
data.rename( columns={'Name' : 'FIO'}, inplace=True)
data.head()

In [ ]:
# Можно заменить названия столбцов
# например, иногда русские названия в исходных данных доставляют трудности
data.columns= ['ID','Survived','Class','FIO','Gender','Age','SibSp','Parch','Ticker number', 'Fare', 'Cabin', 'Emnarked']
data.head()

# Дествия со строками

In [ ]:
data = pd.read_csv('train.csv', delimiter=',')
data.head()

In [ ]:
# Выбрать нужные строки
# например: со второй по пятую
data.loc[0:5]

In [76]:
# Выбор с набором значений
# строки с номерами 1,2,3,44

dataNew = data.iloc[[1,2,3,44]]

In [ ]:
dataNew

In [80]:
# Индексы теперь идут не по порядку
# исправляем

dataNew.reset_index(inplace=True)

In [ ]:
dataNew

In [ ]:
del dataNew['index']

In [ ]:
dataNew

In [ ]:
# Можно задать маску, по которой будут филтроваться строки
# Например ID пасажира делится на 2

mask = (data.PassengerId % 2 == 0)

In [ ]:
mask[:5]

In [ ]:
data.loc[ mask ].head()

In [ ]:
# Либо (Эквивалентно предыдущему способу)

data[data.PassengerId % 2 == 0 ].head()

# Работа с пустыми значениями

In [ ]:
data = pd.read_csv('train.csv', delimiter=',')
data.head()

In [ ]:
# В столбце Age довольно много пустых значений

data.info()

In [ ]:
# Смотрим, что это за строки

data.loc[pd.isnull(data['Age'])].head()

In [ ]:
# усли надо исключить условие, то ставим тильду

data.loc[~pd.isnull(data['Age'])].head()

In [ ]:
# Заменим пустые значения Age на медиану

medianAge = data['Age'].median()
medianAge

In [ ]:
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.fillna.html

data['Age'].fillna( medianAge, inplace = True )

In [ ]:
# итак, значение для строки с индексом 5 (было NaN) заменено на среднее

data.head(10)

# Сортировка

In [ ]:
# Сортировка по индексу

data.sort_index(ascending=False).head()

In [ ]:
# Сортировка по значению

data.sort_values(by='Age',ascending=False).head()

In [ ]:
# Сортировка по значениюнескольких столбцов (Вначале идут иужыки, потом дамы)

data.sort_values(by=['Sex','Age'],ascending=[True,False]).head(500)

# Агрегация и группировка

In [5]:
data = pd.read_csv('train.csv', delimiter=',')
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
# число непустых строк в DataFrame
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.count.html

data.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [ ]:
# для отдельного столбца

data['Age'].count()

In [121]:
# сумма
data.sum()

PassengerId                                               397386
Survived                                                     342
Pclass                                                      2057
Name           Braund, Mr. Owen HarrisCumings, Mrs. John Brad...
Sex            malefemalefemalefemalemalemalemalemalefemalefe...
Age                                                      21205.2
SibSp                                                        466
Parch                                                        340
Ticket         A/5 21171PC 17599STON/O2. 31012821138033734503...
Fare                                                     28693.9
dtype: object

In [122]:
# среднее значение
data.mean()

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [126]:
# комбинация функций
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.aggregate.html

data.aggregate( ['sum', 'mean'] )

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare
sum,397386.0,342.000000,2057.000000,"Braund, Mr. Owen HarrisCumings, Mrs. John Brad...",malefemalefemalefemalemalemalemalemalefemalefe...,21205.170000,466.000000,340.000000,A/5 21171PC 17599STON/O2. 31012821138033734503...,28693.949300
mean,446.0,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208

In [127]:
# агрегация по столбцам (agg - синоним aggregate)

data.agg( { 'Age': ['mean'], 'Survived': ['mean', 'sum'] } )

            Age    Survived
mean  29.699118    0.383838
sum         NaN  342.000000

In [128]:
# группировка по столбцу с вычислением среднего

data.groupby( 'Sex' ).mean().reset_index()

,Sex,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
0,female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
1,male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

In [130]:
# группировка по нескольким столбцам одновременно

data.groupby( ['Sex', 'Age'] ).mean().reset_index()

,Sex,Age,PassengerId,Survived,Pclass,SibSp,Parch,Fare
0,female,0.75,557.500000,1.000000,3.000000,2.000000,1.000000,19.258300
1,female,1.00,277.500000,1.000000,3.000000,0.500000,1.500000,13.437500
2,female,2.00,379.666667,0.333333,2.500000,1.500000,1.500000,43.245833
3,female,3.00,209.500000,0.500000,2.500000,2.000000,1.500000,31.327100
4,female,4.00,451.600000,1.000000,2.600000,0.800000,1.200000,22.828340
5,female,5.00,380.000000,1.000000,2.750000,1.750000,1.250000,22.717700
6,female,6.00,767.500000,0.500000,2.500000,2.000000,1.500000,32.137500
7,female,7.00,536.000000,1.000000,2.000000,0.000000,2.000000,26.250000
8,female,8.00,131.500000,0.500000,2.500000,1.500000,1.500000,23.662500
9,female,9.00,544.500000,0.000000,3.000000,2.500000,1.750000,27.198950
10,female,10.00,420.000000,0.000000,3.000000,0.000000,2.000000,24.150000
11,female,11.00,543.000000,0.000000,3.000000,4.000000,2.000000,31.275000
12,female,13.00,614.000000,1.000000,2.500000,0.000000,0.500000,13.364600
13,female,14.00,125.250000,0.750000,2.250000,0.750000,0.500000,42.291675
14,female,14.50,112.000000,0.000000,3.000000,1.000000,0.000000,14.454200
15,female,15.00,605.000000,1.000000,2.500000,0.250000,0.250000,60.261475
16,female,16.00,354.500000,0.833333,2.000000,0.833333,0.666667,41.043750
17,female,17.00,291.500000,0.833333,2.000000,1.000000,0.333333,35.130550
18,female,18.00,557.307692,0.615385,2.384615,0.461538,0.692308,53.616669
19,female,19.00,361.428571,1.000000,1.857143,0.428571,0.285714,30.727986
20,female,20.00,259.500000,0.000000,3.000000,0.500000,0.000000,9.243750
21,female,21.00,411.000000,0.571429,2.285714,0.714286,0.571429,58.633329
22,female,22.00,451.083333,0.833333,2.166667,0.250000,0.500000,37.009033
23,female,23.00,484.800000,0.800000,2.000000,0.800000,0.400000,81.108340
24,female,24.00,427.062500,0.875000,1.937500,0.625000,0.937500,48.260675
25,female,25.00,587.600000,0.400000,2.200000,0.600000,0.800000,44.650000
26,female,26.00,308.200000,0.600000,2.400000,0.400000,0.200000,27.345840
27,female,27.00,446.166667,0.833333,2.500000,0.333333,0.500000,12.815267
28,female,28.00,472.428571,0.714286,2.285714,0.428571,0.142857,15.849400
29,female,29.00,294.571429,0.714286,2.285714,0.428571,1.000000,45.802971
...,...,...,...,...,...,...,...,...
115,male,42.00,411.700000,0.300000,2.100000,0.300000,0.100000,21.610840
116,male,43.00,601.000000,0.000000,2.666667,0.333333,0.333333,13.583333
117,male,44.00,393.333333,0.166667,2.500000,0.500000,0.166667,26.020833
118,male,45.00,266.166667,0.333333,1.666667,0.166667,0.000000,31.183333
119,male,45.50,268.000000,0.000000,2.000000,0.000000,0.000000,17.862500
120,male,46.00,427.000000,0.000000,1.333333,0.333333,0.000000,55.458333
121,male,47.00,543.857143,0.000000,1.714286,0.000000,0.000000,25.908329
122,male,48.00,611.200000,0.600000,1.600000,0.400000,0.000000,35.226680
123,male,49.00,587.750000,0.500000,1.500000,0.750000,0.250000,64.229175
124,male,50.00,569.600000,0.200000,1.600000,0.800000,0.000000,63.405000
125,male,51.00,404.500000,0.166667,2.166667,0.000000,0.166667,20.551400
126,male,52.00,531.000000,0.250000,1.500000,0.250000,0.250000,34.162500
127,male,54.00,256.600000,0.000000,1.600000,0.200000,0.200000,39.030000
128,male,55.00,493.000000,0.000000,1.000000,0.000000,0.000000,30.500000
129,male,55.50,153.000000,0.000000,3.000000,0.000000,0.000000,8.050000
130,male,56.00,430.333333,0.333333,1.000000,0.000000,0.000000,30.915267
131,male,57.00,627.000000,0.000000,2.000000,0.000000,0.000000,12.350000
132,male,58.00,574.000000,0.000000,1.000000,0.000000,1.000000,71.487500
133,male,59.00,164.000000,0.000000,2.500000,0.000000,0.000000,10.375000
134,male,60.00,656.000000,0.333333,1.333333,0.666667,0.666667,48.250000
135,male,61.00,374.666667,0.000000,1.666667,0.000000,0.000000,24.019433
136,male,62.00,460.000000,0.333333,1.333333,0.000000,0.000000,21.200000
137,male,64.00,492.500000,0.000000,1.000000,0.500000,2.000000,144.500000
138,male,65.00,264.333333,0.000000,1.666667,0.000000,0.333333,32.093067
139,male,66.00,34.000000,0.000000,2.000000,0.000000,0.000000,10.500000
140,male,70.00,709.500000,0.000000,1.500000,0.500000,0.500000,40.750000
141,male,70.50,117.000000,0.000000,3.000000,0.000000,0.000000,7.750000
142,male,71.00,295.500000,0.000000,1.000000,0.000000,0.000000,42.079200
143,male,74.00,852.000000,0.000000,3.000000,0.000000,0.000000,7.775000
144,male,80.00,631.000000,1.000000,1.000000,0.000000,0.000000,30.000000

# Объединение DataFrame

Merge - аналог JOIN в SQL

In [131]:
# заведем два DataFrame

df1 = pd.DataFrame( {
    'key1': ['one', 'two', 'three', 'only1'],
    'value': [1, 2, 3, 4]
} )

In [132]:
df1

    key1  value
0    one      1
1    two      2
2  three      3
3  only1      4

In [133]:
df2 = pd.DataFrame( {
    'key2': ['one', 'two', 'three', 'only2'],
    'value': [11, 12, 13, 14]
} )

In [134]:
df2

    key2  value
0    one     11
1    two     12
2  three     13
3  only2     14

In [135]:
# сохраняем все значения ключей, которые есть в df1
# если нужно несколько столбцов, то пишем left_on = ['key1', ...] и right_on = ['key2', ...]

df1.merge( df2, how = 'left', left_on = 'key1', right_on = 'key2' )

    key1  value_x   key2  value_y
0    one        1    one     11.0
1    two        2    two     12.0
2  three        3  three     13.0
3  only1        4    NaN      NaN

In [136]:
# сохраняем все значения ключей, которые есть в df2

df1.merge( df2, how = 'right', left_on = 'key1', right_on = 'key2' )

    key1  value_x   key2  value_y
0    one      1.0    one       11
1    two      2.0    two       12
2  three      3.0  three       13
3    NaN      NaN  only2       14

In [137]:
# сохраняем все значения ключей (объединение)

df1.merge( df2, how = 'outer', left_on = 'key1', right_on = 'key2' )

    key1  value_x   key2  value_y
0    one      1.0    one     11.0
1    two      2.0    two     12.0
2  three      3.0  three     13.0
3  only1      4.0    NaN      NaN
4    NaN      NaN  only2     14.0

In [138]:
# сохраняем только общие значения ключей

df1.merge( df2, how = 'inner', left_on = 'key1', right_on = 'key2' )

    key1  value_x   key2  value_y
0    one        1    one       11
1    two        2    two       12
2  three        3  three       13

Concat - совмещение DataFrame

In [140]:
# объединение DataFrame путем обычного "склеивания"
pd.concat( [df1, df2],sort=True )

    key1   key2  value
0    one    NaN      1
1    two    NaN      2
2  three    NaN      3
3  only1    NaN      4
0    NaN    one     11
1    NaN    two     12
2    NaN  three     13
3    NaN  only2     14

In [141]:
# горизонтальное объединение
pd.concat( [df1, df2], axis = 1 )

    key1  value   key2  value
0    one      1    one     11
1    two      2    two     12
2  three      3  three     13
3  only1      4  only2     14

Join - объединение по индексу

In [142]:
df1 = pd.DataFrame( {
    'key1': ['one', 'two', 'three', 'only1'],
    'value': [1, 2, 3, 4]
    },
    index = ['0', '1', '2', '3'])

In [143]:
df1

    key1  value
0    one      1
1    two      2
2  three      3
3  only1      4

In [144]:
df2 = pd.DataFrame( {
    'key2': ['one', 'two', 'three', 'only2'],
    'value': [11, 12, 13, 14]
    },
    index = ['2', '3', '4', '5'])

In [145]:
df2

    key2  value
2    one     11
3    two     12
4  three     13
5  only2     14

In [146]:
# для join надо указать lsuffix и rsuffix

df1.join( df2, how = 'left', lsuffix = '_df1', rsuffix = '_df2' )

    key1  value_df1 key2  value_df2
0    one          1  NaN        NaN
1    two          2  NaN        NaN
2  three          3  one       11.0
3  only1          4  two       12.0